brew 'bat'
brew 'chruby'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gpg'
brew 'httpie'
brew 'imagemagick'
brew 'lua'
brew 'mas'
brew 'mitmproxy'
brew 'ncdu'
brew 'openssh'
brew 'ripgrep'
brew 'ruby-install'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tldr'
brew 'tmux'
brew 'vim'
brew 'zsh'
brew 'zoxide'

# Quick Look plugins
cask 'provisionql'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'

# macOS Applications
cask 'aerial'
cask 'alacritty'
cask 'alfred'
cask 'basictex'
cask 'finicky'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'gitup'
cask 'handbrake'
cask 'iina'
cask 'imageoptim'
cask 'itsycal'
cask 'kaleidoscope'
cask 'keepingyouawake'
cask 'keka'
cask 'little-snitch'
cask 'macdown'
cask 'monitorcontrol'
cask 'netnewswire'
cask 'openinterminal-lite'
cask 'paw'
cask 'proxyman'
cask 'rectangle'
cask 'shottr'
cask 'steam'
cask 'visual-studio-code'
cask 'wwdc'
cask 'xcodes'
cask 'zoom'

# Mac App Store Applications
mas 'Slack', id: 803453959
mas 'Pixelmator Pro', id: 1289583905
mas 'Telegram', id: 747648890
mas 'DevCleaner', id: 1388020431
mas 'Bitwarden', id: 1352778147
mas 'WireGuard', id: 1451685025
mas 'Things', id: 904280696
mas 'PDF Viewer', id: 1120099014
mas 'SomaFM miniplayer', id: 1303140142
mas 'CotEditor', id: 1024640650
