# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
# Be sure to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Add `$(brew --prefix findutils)/libexec/gnubin` to `$PATH` if you would prefer these be the defaults.

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
# Be sure to add `$(brew --prefix gnu-sed)/libexec/gnubin` to `$PATH`.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed'

# Install Bash 5.
brew 'bash'
brew 'bash-completion2'

# Install `wget` with IRI support.
brew 'wget'

# Install more recent versions of some macOS tools.
brew 'vim'
# If you would like to map vi so it opens the brew-installed vim: ln -s /usr/local/bin/vim /usr/local/bin/vi
brew 'grep'
brew 'openssh'
brew 'screen'
brew 'php'
brew 'gmp'

# Install other useful binaries.
brew 'ack'
brew 'autojump'
brew 'git'
brew 'git-lfs'
brew 'git-standup'
brew 'gpg'
brew 'httpie'
brew 'imagemagick'
brew 'lua'
brew 'lynx'
brew 'mas'
brew 'mitmproxy'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rbenv'
brew 'rename'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tldr'
brew 'tree'
brew 'vbindiff'
brew 'zopfli'
# Howto video->gif https://gist.github.com/dergachev/4627207
brew 'gifsicle'

# Quick Look plugins
cask 'qlimagesize'
cask 'provisionql'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'

# macOS Applications
cask 'alfred'
cask 'basictex'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitup'
cask 'handbrake'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'itsycal'
cask 'kaleidoscope'
cask 'keepingyouawake'
cask 'keybase'
cask 'mac2imgur'
cask 'macdown'
cask 'opensim'
cask 'paw'
cask 'spectacle'
cask 'steam'
cask 'textmate'
cask 'transmission-remote-gui'
cask 'turbo-boost-switcher'
cask 'visual-studio-code'
cask 'wwdc'

# Mac App Store Applications
mas 'Xcode', id: 497799835
mas 'The Unarchiver', id: 425424353
mas 'Slack', id: 803453959
mas 'Wunderlist', id: 410628904
mas 'Bear', id: 1091189122
mas 'Reeder', id: 880001334
mas 'Pixelmator', id: 407963104
mas 'Telegram', id: 747648890
mas 'Sip', id: 507257563
mas 'Tweetbot', id: 557168941
mas 'Spark', id: 1176895641
mas 'ToothFairy', id: 1191449274
mas 'DevCleaner', id: 1388020431
mas 'Bitwarden', id: 1352778147
